#Если Сервер Тогда
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Номер = ОбщегоНазначенияСервер.ПолучитьНомер(Дата);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Оценки.Записывать = Истина;
	Движения.ПрошедшиеЗанятия.Записывать = Истина;
	Для Каждого ТекСтрокаУроки Из Уроки Цикл
		
		// Регистр Оценки
		Если ЗначениеЗаполнено(ТекСтрокаУроки.Оценка) Тогда
			Движение = Движения.Оценки.Добавить();
			Движение.Период = Дата;
			Движение.Предмет = ТекСтрокаУроки.Предмет;
			Движение.НомерУрока = ТекСтрокаУроки.НомерСтроки;
			Движение.Оценка = ТекСтрокаУроки.Оценка;
			
		КонецЕсли;
		
		// Регистр ПрошедшиеЗанятия
		Движение = Движения.ПрошедшиеЗанятия.Добавить();
		Движение.Период = Дата;
		Движение.Предмет = ТекСтрокаУроки.Предмет;
		Движение.КоличествоУроков = 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Регистр ДомашниеЗадания.
	НаборЗаписей = РегистрыСведений.ДомашниеЗадания.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	Для Каждого СтрокаТабличнойЧасти Из Уроки Цикл
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДомашнееЗадание) Тогда
			НоваяЗапись = НаборЗаписей.Добавить();	
			НоваяЗапись.Период          = НачалоДня(Дата);
			НоваяЗапись.Предмет         = СтрокаТабличнойЧасти.Предмет;
			НоваяЗапись.ДомашнееЗадание = СтрокаТабличнойЧасти.ДомашнееЗадание;
			НоваяЗапись.Выполнено       = СтрокаТабличнойЧасти.Выполнено;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
		
КонецПроцедуры

#КонецЕсли