
Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
	
	
#Если МобильныйКлиент Тогда	
	
	// Получаем информацию об устройстве для пуш уведомлений МК.
	СведенияОМобильномКлиенте = МобильныйКлиентКлиент.НовыйСведенияОМобильномКлиенте();
	
 	ИдентификаторПодписчикаУведомлений = ДоставляемыеУведомления.ПолучитьИдентификаторПодписчикаУведомлений();
	СведенияОМобильномКлиенте.ИдентификаторПодписчикаУведомления = ИдентификаторПодписчикаУведомлений;
		
	ЗаполнитьЗначенияСвойств(СведенияОМобильномКлиенте, Новый СистемнаяИнформация);
	МобильныйКлиентВызовСервера.ЗаписатьИнформациюОМобильномКлиенте(СведенияОМобильномКлиенте);
	
#КонецЕсли

КонецПроцедуры
